"""
Name : Anutta Thongdet
ID : 364411760003
Group : MIT421
"""

# Question 5
#•	ถ้าคะแนนมอยู่ระหว่าง 80.00-100.0 ให้พิมพ์ A
    #•	ถ้าคะแนนอยู่ระหว่าง 75.0 - 79.99 ให้พิมพ์ B+
    #•	ถ้าคะแนนอยู่ระหว่าง 70.0 - 74.99 ให้พิมพ์ B
    #•	ถ้าคะแนนอยู่ระหว่าง 65.0 - 69.99 ให้พิมพ์ C+
    #•	ถ้าคะแนนอยู่ระหว่าง 60.0 - 64.99 ให้พิมพ์ C
    #•	ถ้าคะแนนอยู่ระหว่าง 55.0 - 59.99 ให้พิมพ์ D+
    #•	ถ้าคะแนนอยู่ระหว่าง 50.0 - 54.99 ให้พิมพ์ D
    #•	ถ้าคะแนนน้อยกว่า 49.99 ให้พิมพ์ F

print("ระบบป้อนค่าคะแนน\n")
age = float(input("กรุณาป้อนค่าคะแนน : "))

if age >=80:
    print("A")
elif age >= 75.0 and age <= 79.99:
    print("B+")
elif age >= 70.0 and age <= 74.99:
    print("B")
elif age >= 65.0 and age <= 69.99:
    print("C+")
elif age >= 60.0 and age <= 64.99:
    print("C")
elif age >= 55.0 and age <= 55.99:
    print("D+")
elif age >= 50.0 and age <= 54.99:
    print("D")
else:
    print("F")





